In [167]:
import pandas as pd

In [168]:
url = 'https://info.skat.dk/data.aspx?oid=2276646'
tables = pd.read_html(url, encoding='utf-8', header=0)

In [169]:
df = pd.DataFrame(tables[0])
df.columns = ['Kommunenavn', 'muni_code', 'old_muni_code']

In [170]:

# Split digits in groups of three with a comma between them
def split_numbers(value):
    if isinstance(value, str) and value.isdigit():
        return ', '.join([value[i:i+3] for i in range(0, len(value), 3)])
    return value

df['old_muni_code'] = df['old_muni_code'].apply(split_numbers)

In [179]:
df.to_csv('data.csv', index=False)

In [171]:
# Create a new DataFrame to store the updated values
updated_data = []

# Iterate over each row in the original DataFrame
for _, row in df.iterrows():
    muni_code = row['muni_code']
    old_muni_code = row['old_muni_code']
    
    # Add muni_code to old_muni_code if it's not NaN
    if not pd.isna(old_muni_code):
        old_muni_codes = old_muni_code.split(',')
        if str(muni_code) not in old_muni_codes:
            old_muni_codes.append(str(muni_code))
        for code in old_muni_codes:
            updated_data.append({'Kommunenavn': row['Kommunenavn'], 'muni_code': muni_code, 'old_muni_code': code.strip()})
    else:
        updated_data.append({'Kommunenavn': row['Kommunenavn'], 'muni_code': muni_code, 'old_muni_code': str(muni_code)})

# Create the updated DataFrame
updated_df = pd.DataFrame(updated_data)

In [172]:
unique_combinations = updated_df[['muni_code', 'old_muni_code']].duplicated(keep=False)
updated_df = updated_df[~unique_combinations]

In [173]:
updated_df

     Kommunenavn  muni_code old_muni_code
0    Albertslund        165           165
1        Allerød        201           201
2         Assens        420           421
3         Assens        420           433
4         Assens        420           437
..           ...        ...           ...
331      Aalborg        851           831
332      Aalborg        851           837
333      Aalborg        851           851
334        Århus        751           751
335     Udlandet        999           999

[332 rows x 3 columns]

In [178]:
updated_df.to_csv('nye_og_gamle_kommuner.csv', index=False)